#include <iostream>
using namespace std;

void main()
{
	/*4. Напишите программу, реализующую популярную телевизионную игру «Кто хочет стать миллионером». */

	int marka;
	int edinic;
	int capital;
	
	setlocale(LC_ALL, "RUS");

	cout << ("Выбирете марку Отечественного автомобиля: \n\n");
	cout << ("Выбирите число от 1 до 4: \n\n");
	cout << ("1)Opel\t2)Ford\t3)Audi\t4)Vaz\n\n");
	cin >> marka;

	if

		(marka == 4)

	{
		cout << ("Поздравляем ответ правильный\n\n");
	}

	else
	{
		cout << ("Ответ не правильный\n\n");
	}

	cout << ("Выбирете единцы измерения напряжения: \n\n");
	cout << ("Выбирите число от 1 до 4: \n\n");
	cout << ("1)Амперы\t2)Кельвины\t3)Вольты\t4)Градусы\n\n");
	cin >> edinic;

	if
		(edinic == 3)
	{
		cout << ("Поздравляем ответ правильный\n\n");
	}
	else
	{
		cout << ("Ответ не правильный\n\n");
	}

	cout << ("Выбирете столицу Канады: \n\n");
	cout << ("Выбирите число от 1 до 4: \n\n");
	cout << ("1)Киев\t2)Оттава\t3)Вашингтон\t4)Торонто\n\n");
	cin >> capital;

	if

		(capital == 2)

	{
		cout << ("Поздравляем ответ правильный\n\n");
	}

	else
	{
		cout << ("Ответ не правильный\n\n");
	}
}