#include <iostream>
using namespace std;

void main()
{
	/*1. Напишите программу, проверяющую число, введенное с клавиатуры на четность. */

	int a;
	int b;
	int c;
	cin >> a;

	b = a / 2;  /* при делении у четного будет целое значение, у не четного отбросится дробная часть*/
	c = b * 2; 
	if
		(c < a)
	{
		cout << "Ne chetnoe\n"; }
	else
	{
		cout << "Chotnoe\n";
	}
	